CSE-221710313011-D.Manasa

In [0]:
import pandas as pd
import numpy as np

##Question 1:
Experiment pivot_table() function on given DataFrame

In [2]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"],
                  	       "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                   	        "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                               "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                               "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

This first example aggregates values by taking the sum.

In [3]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [4]:
# fill value parameter
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [5]:
#aggregate functions
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

##Question 2:

In [6]:
# How to store a pandas DataFrame as csv file
import pandas as pd  
import numpy as np
nme = ["bhavna", "raj", "rani", "ravi"] 
deg = ["MBA", "Btech", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98] 
dict = {'name': nme, 'degree': deg, 'score': scr}       
df = pd.DataFrame(dict)
df.to_csv('file1.csv') 
df1=pd.read_csv("file1.csv")
df1

   Unnamed: 0    name  degree  score
0           0  bhavna     MBA     90
1           1     raj   Btech     40
2           2    rani  M.Tech     80
3           3    ravi     MBA     98

##Question 3:
1. For IPL_2018 and IPL_2017 DataFrame finds the sum of both DataFrames and store the result in the DataFrame with the name Total.
2. Creating a new column to Total DataFrame - 'Win Percentage' and values of that column will be matches won/matches played.
3. Sort the teams with the most number of wins.If the number of wins of two teams are the same, sort by the win percentage.

In [7]:
IPL_2018 = pd.DataFrame({'IPL Team': ['CSK', 'SRH', 'KKR', 'RR', 'MI', 'RCB', 'KXIP', 'DD'],
                         'Played': [16, 17, 16, 15, 14, 14, 14, 14],
                         'Won': [11, 10, 9, 7, 6, 6, 6, 5]}
                       )
# Set the 'IPL Team' column as the index to perform arithmetic operations on the other rows using the team as reference
IPL_2018.set_index('IPL Team', inplace = True)
IPL_2018

          Played  Won
IPL Team
CSK           16   11
SRH           17   10
KKR           16    9
RR            15    7
MI            14    6
RCB           14    6
KXIP          14    6
DD            14    5

In [8]:
IPL_2017 = pd.DataFrame({'IPL Team': ['MI', 'RPS', 'KKR', 'SRH', 'KXIP', 'DD', 'GL', 'RCB'],
                         'Played': [17, 16, 16, 15, 14, 14, 14, 14],
                         'Won': [12, 10, 9, 8, 7, 6, 4, 3]}
                       )
IPL_2017.set_index('IPL Team', inplace = True)
IPL_2017

          Played  Won
IPL Team
MI            17   12
RPS           16   10
KKR           16    9
SRH           15    8
KXIP          14    7
DD            14    6
GL            14    4
RCB           14    3

In [9]:
total=IPL_2017.add(IPL_2018,fill_value=0)
total

          Played   Won
IPL Team
CSK         16.0  11.0
DD          28.0  11.0
GL          14.0   4.0
KKR         32.0  18.0
KXIP        28.0  13.0
MI          31.0  18.0
RCB         28.0   9.0
RPS         16.0  10.0
RR          15.0   7.0
SRH         32.0  18.0

In [10]:
total['win_percentage']=total.apply(lambda row:row.Played,axis=1)
total

          Played   Won  win_percentage
IPL Team
CSK         16.0  11.0            16.0
DD          28.0  11.0            28.0
GL          14.0   4.0            14.0
KKR         32.0  18.0            32.0
KXIP        28.0  13.0            28.0
MI          31.0  18.0            31.0
RCB         28.0   9.0            28.0
RPS         16.0  10.0            16.0
RR          15.0   7.0            15.0
SRH         32.0  18.0            32.0

In [11]:
total=total.sort_values(by=['Won','win_percentage'])
total

          Played   Won  win_percentage
IPL Team
GL          14.0   4.0            14.0
RR          15.0   7.0            15.0
RCB         28.0   9.0            28.0
RPS         16.0  10.0            16.0
CSK         16.0  11.0            16.0
DD          28.0  11.0            28.0
KXIP        28.0  13.0            28.0
MI          31.0  18.0            31.0
KKR         32.0  18.0            32.0
SRH         32.0  18.0            32.0